tap "puma/puma"
tap "heroku/brew"

# brew the latest version of alacritty
cask "alacritty"

# https://mitmproxy.org
cask "mitmproxy"

# don't forget to set default shell to /opt/homebrew/bin/zsh
brew "zsh"

# https://github.com/dylanaraps/neofetch
brew "neofetch"

# https://asciinema.erg
brew "asciinema"

# bat, like cat - https://github.com/sharkdp/bat
brew "bat"

# https://github.com/denilsonsa/prettyping
brew "prettyping"

# https://github.com/orf/gping
brew "gping"

# http://hisham.hm/htop/
brew "htop"

# btop, like htop - https://github.com/aristocratos/btop
brew "btop"

# https://httpie.org
brew "httpie"

# https://github.com/julienXX/terminal-notifier
brew "terminal-notifier"

# https://github.com/sharkdp/hexyl
brew "hexyl"

# https://jonas.github.io/tig/
brew "tig"

# https://cli.github.com
brew "gh"

# https://github.com/DarthSim/overmind
brew "overmind"

# https://tldr.sh
brew "tldr"

# https://github.com/BurntSushi/ripgrep
brew "rg"

# https://stedolan.github.io/jq/
brew "jq"

# https://github.com/antonmedv/fx
brew "fx"

# https://deno.land
brew "deno"

# to tunnel e.g. cloudflared tunnel --url http://localhost:3000
brew "cloudflared"
brew "agrinman/tap/tunnelto"

brew "imagemagick"
brew "vips"
brew "mupdf-tools"
brew "scmpuff"
brew "exiftool"
brew "node"
brew "node@14"
brew "fzf"
brew "postgresql@14"
brew "ctags"
brew "vim"
brew "neovim"
brew "git-delta"
brew "less"
brew "wget"
brew "puma/puma/puma-dev"
brew "yarn"
brew "memcached"
brew "redis"
brew "mercurial"
brew "ffmpeg"
brew "awscli"
brew "chruby"
brew "ruby-install"
brew "restic"
brew "fswatch"
brew "irssi"
brew "heroku"

# git
brew "git"
brew "git-interactive-rebase-tool"

tap 'dirk/quickhook'
brew 'quickhook'
