tap "homebrew/cask"

# https://github.com/dylanaraps/neofetch
brew "neofetch"

# http://nshipster.com/xctool/
brew "xctool"

# https://asciinema.erg
brew "asciinema"

# bat, like cat - https://github.com/sharkdp/bat
brew "bat"

# https://github.com/denilsonsa/prettyping
brew "prettyping"

# http://hisham.hm/htop/
brew "htop"

# https://httpie.org
brew "httpie"

# https://direnv.net
brew "direnv"

# http://tldr.sh
brew "tldr"

# https://github.com/julienXX/terminal-notifier
brew "terminal-notifier"

# https://github.com/sharkdp/hexyl
brew "hexyl"

# https://jonas.github.io/tig/
brew "tig"

# https://cli.github.com
brew "github/gh/gh"

# https://github.com/DarthSim/overmind
brew "overmind"

# https://ngrok.com
cask "ngrok"
