tap "homebrew/cask"

# https://github.com/dylanaraps/neofetch
brew "neofetch"

# http://nshipster.com/xctool/
brew "xctool"

# https://asciinema.erg
brew "asciinema"

# bat, like cat - https://github.com/sharkdp/bat
brew "bat"

# https://github.com/denilsonsa/prettyping
brew "prettyping"

# https://github.com/orf/gping
brew "gping"

# http://hisham.hm/htop/
brew "htop"

# https://httpie.org
brew "httpie"

# https://direnv.net
brew "direnv"

# https://github.com/julienXX/terminal-notifier
brew "terminal-notifier"

# https://github.com/sharkdp/hexyl
brew "hexyl"

# https://jonas.github.io/tig/
brew "tig"

# https://cli.github.com
brew "gh"

# https://github.com/DarthSim/overmind
brew "overmind"

# https://tldr.sh
brew "tldr"

# https://github.com/BurntSushi/ripgrep
brew "rg"

# https://stedolan.github.io/jq/
brew "jq"

# https://github.com/antonmedv/fx
brew "fx"

brew "scmpuff"
brew "gpg2"
brew "circleci"
brew "node"
brew "fzf"
brew "postgresql"
brew "git"
brew "ctags"
brew "vim"
brew "wget"
brew "puma/puma/puma-dev"
brew "yarn"
brew "rabbitmq"
brew "memcached"
brew "redis"
brew "mercurial"
brew "ffmpeg"
brew "awscli"
brew "chruby"
brew "ruby-install"
brew "restic"
brew "mupdf"

tap "heroku/brew"
brew "heroku"

# Casks
cask "ngrok"
cask "aws-vault"
cask "alacritty"
